{"result":[{"author":{"id":"4898008"},"id":"2287345","title":"南非遭风暴袭击 大风掀巨浪游人作死冒险拍照留念","introduction":"取当前工作目录（Current Work Directory），这个不同于“脚本所在目录”。如果你是通过命令行调用的，那么就应该是入口脚本的目录；如果是通过其他进程调用的会继承下来。\r\n\r\n可以通过process.chdir来修改。","time":"2017/06/26","lookCount":0},{"author":{"id":"59114350"},"id":"74752596","title":"limits","introduction":"file(< string >fieldname, < ReadableStream >stream, < string >filename, < string >transferEncoding, < string >mimeType) - Emitted for each new file form field found. transferEncoding contains the 'Content-Transfer-Encoding' value for the file stream. mimeType contains the 'Content-Type' value for the file stream.\r\n\r\nNote: if you listen for this event, you should always handle the stream no matter if you care about the file contents or not (e.g. you can simply just do stream.resume(); if you want to discard the contents), otherwise the 'finish' event will never fire on the Busboy instance. However, if you don't care about any incoming files, you can simply not listen for the 'file' event at all and any/all files will be automatically and safely discarded (these discarded files do still count towards files and parts limits).\r\nIf a configured file size limit was reached, stream will both have a boolean property truncated (best checked at the end of the stream) and emit a 'limit' event to notify you when this happens.\r\nfield(< string >fieldname, < string >value, < boolean >fieldnameTruncated, < boolean >valueTruncated, < string >transferEncoding, < string >mimeType) - Emitted for each new non-file field found.\r\n\r\npartsLimit() - Emitted when specified parts limit has been reached. No more 'file' or 'field' events will be emitted.\r\n\r\nfilesLimit() - Emitted when specified files limit has been reached. No more 'file' events will be emitted.\r\n\r\nfieldsLimit() - Emitted when specified fields limit has been reached. No more 'field' events will be emitted.","time":"2017/06/27","lookCount":0},{"author":{"id":"4898008"},"id":"73966163","title":"河南开封：“斗瓜”大赛精彩纷呈","introduction":"6月27日，观众和评出的“瓜王”合影。当日，开封杏花营镇第二届西瓜文化节“斗瓜”大赛在河南开封西瓜市场举行，当地百余名瓜农参赛，吸引众多游客前来参观。新华社发（张涛 摄）\r\n6月27日，“斗瓜”大赛吸引了许多观众前来参观。当日，开封杏花营镇第二届西瓜文化节“斗瓜”大赛在河南开封西瓜市场举行，当地百余名瓜农参赛，吸引众多游客前来参观。新华社发（张涛 摄）","time":"2017/06/28","lookCount":0}],"totalCount":3}